---
kind: enumMember
id: F:Autodesk.Revit.DB.DirectShapeTargetViewType.Plan
enum: Autodesk.Revit.DB.DirectShapeTargetViewType
source: html/1c5cd94e-3804-54da-73af-505655b0948f.htm
---
# Autodesk.Revit.DB.DirectShapeTargetViewType.Plan

The alternate representation will be used only in Revit Plan views